Enums/ВидыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСделок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/БиржеваяОперация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>БиржеваяОперация</Name>
			<BasedOn>
				<xr:Item>Document.БиржеваяОперация</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПозицииИнструментов</xr:Item>
				<xr:Item>AccumulationRegister.ФинансовыеРезультатыПоСделкам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтратегияСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтратегииСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсСделки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OperationId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шорт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛотов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Позиции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЛотов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ИнтеграцияTInvestИмпортОпераций/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура TI_ИмпортироватьОперацииВБиржевыеОперации(Счет, ИсточникДанных, Операции)
// Импортирует массив операций T-Invest в документы предметного учёта.
// Параметры:
// Счет -- счёт учета
// ИсточникДанных -- ссылка на справочник источников данных
// Операции -- массив операций API
// Результат:
// создаёт или обновляет документы по операциям покупки/продажи
// подтягивает комиссию по связанным операциям
// Особенности:
// обрабатываются только операции покупки и продажи
// выполняется антидублирование по OperationId
// для существующего документа без заполненной стратегии допускается обновление
// операция сопоставляется по instrumentUid
Процедура TI_ИмпортироватьОперацииВБиржевыеОперации(Счет, ИсточникДанных, Операции) Экспорт
	
	КомиссииПоРодителю = TI_СобратьКомиссииПоРодителю(Операции);

	Для Каждого Операция Из Операции Цикл

		Если НЕ Операция.Свойство("operationType") Тогда
			Продолжить;
		КонецЕсли;

		// Берём только покупки/продажи. Комиссии подтянем по parentOperationId.
		Если Операция.operationType <> "OPERATION_TYPE_BUY"
		   И Операция.operationType <> "OPERATION_TYPE_SELL" Тогда
			Продолжить;
		КонецЕсли;

		OperationId = Операция.id;
		Если НЕ ЗначениеЗаполнено(OperationId) Тогда
			Продолжить;
		КонецЕсли;

		// анти-дубль
		ДокументБиржеваяОперацияСсылка = TI_НайтиДокументБиржеваяОперацияПоOperationId(Счет, OperationId);
		Если ДокументБиржеваяОперацияСсылка = Неопределено Тогда
			ДокументБиржеваяОперация = Документы.БиржеваяОперация.СоздатьДокумент();
		Иначе
			СтратегияСделки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументБиржеваяОперацияСсылка, "СтратегияСделки");
			Если ЗначениеЗаполнено(СтратегияСделки) Тогда
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Биржевая операция %1 уже проведена, не загружаем повторно", ДокументБиржеваяОперацияСсылка), ДокументБиржеваяОперацияСсылка);
				Продолжить;
			Иначе
				ДокументБиржеваяОперация = ДокументБиржеваяОперацияСсылка.ПолучитьОбъект();
				ДокументБиржеваяОперация.Позиции.Очистить();
			КонецЕсли;
		КонецЕсли;

		// инструмент по instrumentUid (предпочтительнее, чем FIGI)
		InstrumentUid = Операция.instrumentUid;
		Если НЕ ЗначениеЗаполнено(InstrumentUid) Тогда
			// fallback на figi, если захочешь
			Продолжить;
		КонецЕсли;

		Инструмент = Справочники.Инструменты.ПолучитьИнструментПоУИД(InstrumentUid);

		ДокументБиржеваяОперация.Счет = Счет;
		ДокументБиржеваяОперация.Дата = ИнтеграцияTInvestСлужебный.ПреобразоватьСтрокуВДату(Операция.date);
		ДокументБиржеваяОперация.ВидСделки = 
			?(Операция.operationType = "OPERATION_TYPE_BUY",
			  Перечисления.ВидыСделок.Покупка,
			  Перечисления.ВидыСделок.Продажа);
			  
		Валюта = Справочники.Валюты.НайтиПоНаименованию(Операция.currency);
		ДокументБиржеваяОперация.ВалютаСделки = Валюта;
		Если Операция.currency = "rub" Тогда
			ДокументБиржеваяОперация.КурсСделки = 1;
		Иначе
			ДокументБиржеваяОперация.КурсСделки = РасчетыВДокументах.КурсВалютыНаДату(ДокументБиржеваяОперация.Дата, Валюта);
		КонецЕсли;
		ДокументБиржеваяОперация.OperationId = Операция.id;
		ДокументБиржеваяОперация.Источник = ИсточникДанных;

		ДокументБиржеваяОперация.Инструмент = Инструмент;

		Количество = Число(Операция.quantity);
		ДокументБиржеваяОперация.Количество = Количество;

		РазмерЛота = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Инструмент, "РазмерЛота");
		Если РазмерЛота <> 0 Тогда
			ДокументБиржеваяОперация.КоличествоЛотов = Количество / РазмерЛота;
		Иначе
			ДокументБиржеваяОперация.КоличествоЛотов = Количество;
		КонецЕсли;

		ДокументБиржеваяОперация.Цена = ИнтеграцияTInvestСлужебный.СуммаИзКотировки(Операция.price);

		Комиссия = КомиссииПоРодителю.Получить(Операция.id);
		Если Комиссия = Неопределено Тогда Комиссия = 0; КонецЕсли;
		ДокументБиржеваяОперация.Комиссия = Комиссия;

		ДокументБиржеваяОперация.Записать();
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Записан документ %1", ДокументБиржеваяОперация.Ссылка), ДокументБиржеваяОперация.Ссылка);

	КонецЦикла;

КонецПроцедуры // TI_ИмпортироватьОперацииВБиржевыеОперации

// Функция TI_ИмпортироватьОперацииПоКурсоруВБиржевыеОперации(Счет, ИсточникДанных, ОтветКурсора)
// Импортирует операции из cursor-ответа T-Invest в документы БиржеваяОперация.
// Параметры:
// Счет -- счёт учета
// ИсточникДанных -- источник данных
// ОтветКурсора -- массив операций или структура ответа cursor API
// Результат:
// создаёт или обновляет документы БиржеваяОперация
// Особенности:
// поддерживает входные данные в разных форматах (Массив, items, operations)
// определяет тип операции через TI_ТипОперации
// комиссии собираются через TI_СобратьКомиссииПоРодителюУниверсально
// выполняется антидублирование по OperationId
Процедура TI_ИмпортироватьОперацииПоКурсоруВБиржевыеОперации(Счет, ИсточникДанных, ОтветКурсора) Экспорт

	Если ОтветКурсора = Неопределено Тогда Возврат; КонецЕсли;

	// В cursor-ответе обычно items, но подстрахуемся.
	Операции = Неопределено;
	Если ТипЗнч(ОтветКурсора) = Тип("Массив") Тогда
		Операции = ОтветКурсора;
	ИначеЕсли ОтветКурсора.Свойство("items") Тогда
		Операции = ОтветКурсора.items;
	ИначеЕсли ОтветКурсора.Свойство("operations") Тогда
		Операции = ОтветКурсора.operations;
	Иначе
		Возврат;
	КонецЕсли;

	КомиссииПоРодителю = TI_СобратьКомиссииПоРодителюУниверсально(Операции);

	Для Каждого Операция Из Операции Цикл

		ТипОпер = TI_ТипОперации(Операция);

		// Иногда type человекочитаемый. Тогда пытаемся опознать по operationTypeName/operationType не вышло.
		Если ТипОпер = "Покупка ценных бумаг" Тогда ТипОпер = "OPERATION_TYPE_BUY"; КонецЕсли;
		Если ТипОпер = "Продажа ценных бумаг" Тогда ТипОпер = "OPERATION_TYPE_SELL"; КонецЕсли;

		Если ТипОпер <> "OPERATION_TYPE_BUY"
		   И ТипОпер <> "OPERATION_TYPE_SELL" Тогда
			Продолжить;
		КонецЕсли;

		OperationId = TI_ПолучитьСвойство(Операция, "id");
		Если НЕ ЗначениеЗаполнено(OperationId) Тогда Продолжить; КонецЕсли;

		// анти-дубль / обновление
		ДокументБиржеваяОперацияСсылка = TI_НайтиДокументБиржеваяОперацияПоOperationId(Счет, OperationId);
		Если ДокументБиржеваяОперацияСсылка = Неопределено Тогда
			ДокументБиржеваяОперация = Документы.БиржеваяОперация.СоздатьДокумент();
		Иначе
			СтратегияСделки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументБиржеваяОперацияСсылка, "СтратегияСделки");
			Если ЗначениеЗаполнено(СтратегияСделки) Тогда
				Продолжить;
			Иначе
				ДокументБиржеваяОперация = ДокументБиржеваяОперацияСсылка.ПолучитьОбъект();
				// можно очистить ТЧ, если хочешь “перезалить”
				ДокументБиржеваяОперация.Позиции.Очистить();
			КонецЕсли;
		КонецЕсли;

		InstrumentUid = TI_ПолучитьСвойство(Операция, "instrumentUid");
		Если НЕ ЗначениеЗаполнено(InstrumentUid) Тогда
			Продолжить;
		КонецЕсли;

		Инструмент = Справочники.Инструменты.ПолучитьИнструментПоУИД(InstrumentUid);

		ДатаISO = TI_ПолучитьСвойство(Операция, "date", "dateTime");
		ДокументБиржеваяОперация.Дата = ИнтеграцияTInvestСлужебный.ПреобразоватьСтрокуВДату(ДатаISO);

		ДокументБиржеваяОперация.Счет = Счет;
		ДокументБиржеваяОперация.ВидСделки =
			?(ТипОпер = "OPERATION_TYPE_BUY",
			  Перечисления.ВидыСделок.Покупка,
			  Перечисления.ВидыСделок.Продажа);

		// Валюта: в cursor-формате часто только внутри price/payment
		КодВалюты = TI_ВалютаИзЦеныИлиПлатежа(Операция);
		Если ЗначениеЗаполнено(КодВалюты) Тогда
			Валюта = Справочники.Валюты.НайтиПоНаименованию(КодВалюты);
			ДокументБиржеваяОперация.ВалютаСделки = Валюта;

			Если КодВалюты = "rub" Тогда
				ДокументБиржеваяОперация.КурсСделки = 1;
			Иначе
				ДокументБиржеваяОперация.КурсСделки = РасчетыВДокументах.КурсВалютыНаДату(ДокументБиржеваяОперация.Дата, Валюта);
			КонецЕсли;
		КонецЕсли;

		ДокументБиржеваяОперация.OperationId = OperationId;
		ДокументБиржеваяОперация.Источник = ИсточникДанных;

		ДокументБиржеваяОперация.Инструмент = Инструмент;

		Количество = Число(TI_ПолучитьСвойство(Операция, "quantity", "quantityUnits"));
		ДокументБиржеваяОперация.Количество = Количество;

		РазмерЛота = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Инструмент, "РазмерЛота");
		Если РазмерЛота <> 0 Тогда
			ДокументБиржеваяОперация.КоличествоЛотов = Количество / РазмерЛота;
		Иначе
			ДокументБиржеваяОперация.КоличествоЛотов = Количество;
		КонецЕсли;

		ЦенаСтр = TI_ПолучитьСвойство(Операция, "price");
		Если ЦенаСтр <> Неопределено Тогда
			ДокументБиржеваяОперация.Цена = ИнтеграцияTInvestСлужебный.СуммаИзКотировки(ЦенаСтр);
		Иначе
			// иногда бывает без price, тогда можно оценить через payment/quantity, но лучше пропустить
			ДокументБиржеваяОперация.Цена = 0;
		КонецЕсли;

		Комиссия = КомиссииПоРодителю.Получить(OperationId);
		Если Комиссия = Неопределено Тогда Комиссия = 0; КонецЕсли;
		ДокументБиржеваяОперация.Комиссия = Комиссия;

		ДокументБиржеваяОперация.Записать();
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Записан документ %1", ДокументБиржеваяОперация.Ссылка), ДокументБиржеваяОперация.Ссылка);

	КонецЦикла;

КонецПроцедуры // TI_ИмпортироватьОперацииПоКурсоруВБиржевыеОперации

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция TI_НайтиДокументБиржеваяОперацияПоOperationId(Счет, OperationId)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	БиржеваяОперация.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.БиржеваяОперация КАК БиржеваяОперация
	|ГДЕ
	|	БиржеваяОперация.Счет = &Счет
	|	И БиржеваяОперация.OperationId = &OperationId";

	Запрос.УстановитьПараметр("Счет", Счет);
	Запрос.УстановитьПараметр("OperationId", OperationId);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции // TI_НайтиДокументБиржеваяОперацияПоOperationId

Функция TI_СобратьКомиссииПоРодителю(Операции)
	Комиссии = Новый Соответствие; // key: parentOperationId, value: сумма комиссии (положительное число)

	Для Каждого Операция Из Операции Цикл
		Если Операция.Свойство("operationType") 
			И Операция.operationType = "OPERATION_TYPE_BROKER_FEE"
			И ЗначениеЗаполнено(Операция.parentOperationId) Тогда

			Сумма = -ИнтеграцияTInvestСлужебный.СуммаИзКотировки(Операция.payment); // payment отрицательный, комиссию храним положительной
			Если Сумма < 0 Тогда
				Сумма = -Сумма;
			КонецЕсли;

			КомиссияСделки = Комиссии.Получить(Операция.parentOperationId);
			Если КомиссияСделки = Неопределено Тогда КомиссияСделки = 0; КонецЕсли;

			Комиссии.Вставить(Операция.parentOperationId, КомиссияСделки + Сумма);
		КонецЕсли;
	КонецЦикла;

	Возврат Комиссии;
КонецФункции

// TI_СобратьКомиссииПоРодителюУниверсально(Операции)
// Назначение:
// Строит соответствие комиссий по parentOperationId на основании массива операций T-Invest.
// Параметры:
// Операции -- массив операций API
// Возвращаемое значение:
// Соответствие, где:
// ключ -- идентификатор родительской операции
// значение -- сумма комиссии
// Особенности:
// учитывает как отдельные операции комиссии
// так и вложенные childOperations
Функция TI_СобратьКомиссииПоРодителюУниверсально(Операции)
	Комиссии = Новый Соответствие; // key: parentId, value: сумма (положительная)

	Для Каждого Оп Из Операции Цикл

		// 1) Классика: отдельная операция комиссии (BROKER_FEE) с parentOperationId
		Если Оп.Свойство("operationType") И Оп.operationType = "OPERATION_TYPE_BROKER_FEE" Тогда
			ParentId = TI_ПолучитьСвойство(Оп, "parentOperationId");
			Если ЗначениеЗаполнено(ParentId) Тогда
				Сумма = -ИнтеграцияTInvestСлужебный.СуммаИзКотировки(TI_ПолучитьСвойство(Оп, "payment"));
				Если Сумма < 0 Тогда
					Сумма = -Сумма;
				КонецЕсли;
				Тек = Комиссии.Получить(ParentId);
				Если Тек = Неопределено Тогда
					Тек = 0;
				КонецЕсли;
				Комиссии.Вставить(ParentId, Тек + Сумма);
			КонецЕсли;
		КонецЕсли;

		// 2) Cursor/прочие варианты: комиссия в childOperations без id
		ChildOps = TI_ПолучитьСвойство(Оп, "childOperations");
		Если ТипЗнч(ChildOps) = Тип("Массив") Тогда
			Для Каждого Ч Из ChildOps Цикл
				Платеж = TI_ПолучитьСвойство(Ч, "payment");
				Если Платеж <> Неопределено Тогда
					Сумма = -ИнтеграцияTInvestСлужебный.СуммаИзКотировки(Платеж);
					Если Сумма < 0 Тогда
						Сумма = -Сумма;
					КонецЕсли;
					Тек = Комиссии.Получить(Оп.id); 
					Если Тек = Неопределено Тогда
						Тек = 0;
					КонецЕсли;
					Комиссии.Вставить(Оп.id, Тек + Сумма);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;

	Возврат Комиссии;
КонецФункции

Функция TI_ТипОперации(Операция)
	// В разных форматах может быть:
	// operationType: "OPERATION_TYPE_BUY"
	// type: "OPERATION_TYPE_BUY" или человекочитаемое "Покупка ценных бумаг"
	Тип = TI_ПолучитьСвойство(Операция, "operationType");
	Если ЗначениеЗаполнено(Тип) Тогда
		Возврат Тип;
	КонецЕсли;

	Тип = TI_ПолучитьСвойство(Операция, "type");
	Если ЗначениеЗаполнено(Тип) Тогда
		Возврат Тип;
	КонецЕсли;

	Возврат "";
КонецФункции

Функция TI_ВалютаИзЦеныИлиПлатежа(Операция)
	Цена = TI_ПолучитьСвойство(Операция, "price");
	Если Цена <> Неопределено Тогда
		Вал = TI_ПолучитьСвойство(Цена, "currency");
		Если ЗначениеЗаполнено(Вал) Тогда
			Возврат Вал;
		КонецЕсли;
	КонецЕсли;

	Платеж = TI_ПолучитьСвойство(Операция, "payment");
	Если Платеж <> Неопределено Тогда
		Вал = TI_ПолучитьСвойство(Платеж, "currency");
		Если ЗначениеЗаполнено(Вал) Тогда
			Возврат Вал;
		КонецЕсли;
	КонецЕсли;

	Возврат "";
КонецФункции

Функция TI_ПолучитьСвойство(СтруктураДанных, Имя1, Имя2 = "", Имя3 = "")
	Если СтруктураДанных = Неопределено Тогда Возврат Неопределено; КонецЕсли;

	Если ЗначениеЗаполнено(Имя1) И СтруктураДанных.Свойство(Имя1) Тогда Возврат СтруктураДанных[Имя1]; КонецЕсли;
	Если ЗначениеЗаполнено(Имя2) И СтруктураДанных.Свойство(Имя2) Тогда Возврат СтруктураДанных[Имя2]; КонецЕсли;
	Если ЗначениеЗаполнено(Имя3) И СтруктураДанных.Свойство(Имя3) Тогда Возврат СтруктураДанных[Имя3]; КонецЕсли;

	Возврат Неопределено;
КонецФункции

#КонецОбласти
